tutorials/verificationAndValidation/axisymmetricHemispherical/sim/interPlicPhaseChangeFoam/cavNum03/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite
runApplication checkMesh

touch ${PWD##*/}.foam

#------------------------------------------------------------------------------
